xdu-aero-association/FM33LC0XX_Example_0.04/SPI 从机中断示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_spi.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_spi.h
  * @author  FMSH Application Team
  * @brief   Head file of SPI LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_SPI_H
#define __FM33LC0XX_LL_SPI_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_SPI
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup SPI_LL_ES_INIT SPI Exported Init structures
  * @{
  */

/**
  * @brief LL SPI Init Sturcture definition
  */
typedef struct
{
    /*! SPI传输方向 接受发送 */
    uint32_t TransferDirection;
    /*! 传输模式 单双工 */ 
    uint32_t TransferMode;
    /*! 主从模式 */
    uint32_t Mode;             
    /*! 数据位宽 */
    uint32_t DataWidth;        
    /*! 时钟极性 */                        
    uint32_t ClockPolarity;    
    /*! 时钟相位 */
    uint32_t ClockPhase;       
    /*! NSS 脚模式 软件或硬件 */
    uint32_t SSN;              
    /*! 通讯速率 */
    uint32_t BaudRate;         
    /*! Bit方向 */
    uint32_t BitOrder;         
                          
} LL_SPI_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup SPI_LL_Exported_Constants SPI Exported Constants
  * @{
  */
#define    LL_SPI_SWAP_MOMI_PIN_DISABLE                           (0x0U << SPI_CR1_IOSWAP_Pos)
#define    LL_SPI_SWAP_MOMI_PIN_ENABLE                            (0x1U << SPI_CR1_IOSWAP_Pos)

#define    LL_SPI_SAMP_POSITION_NORMAL                            (0x0U << SPI_CR1_MSPA_Pos)
#define    LL_SPI_SAMP_POSITION_DELAY_HALF_CLK                    (0x1U << SPI_CR1_MSPA_Pos)

#define    LL_SPI_SEND_POSITION_NORMAL                            (0x0U << SPI_CR1_SSPA_Pos)
#define    LL_SPI_SEND_POSITION_ADVANCE_HALF_CLK                  (0x1U << SPI_CR1_SSPA_Pos)

#define    LL_SPI_WORK_MODE_SLAVE                                 (0x0U << SPI_CR1_MM_Pos)
#define    LL_SPI_WORK_MODE_MASTER                                (0x1U << SPI_CR1_MM_Pos)

#define    LL_SPI_SEND_POSITION_SLAVE                             (0x0U << SPI_CR1_MM_Pos)
#define    LL_SPI_SEND_POSITION_MASTER                            (0x1U << SPI_CR1_MM_Pos)

#define    LL_SPI_BAUDRATEPRESCALER_DIV2                          (0x0U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV4                          (0x1U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV8                          (0x2U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV16                         (0x3U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV32                         (0x4U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV64                         (0x5U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV128                        (0x6U << SPI_CR1_BAUD_Pos)
#define    LL_SPI_BAUDRATEPRESCALER_DIV256                        (0x7U << SPI_CR1_BAUD_Pos)

#define    LL_SPI_BIT_ORDER_MSB_FIRST                             (0x0U << SPI_CR1_LSBF_Pos)
#define    LL_SPI_BIT_ORDER_LSB_FIRST                             (0x1U << SPI_CR1_LSBF_Pos)

#define    LL_SPI_SPI_POLARITY_LOW                                (0x0U << SPI_CR1_CPOL_Pos)
#define    LL_SPI_SPI_POLARITY_HIGH                               (0x1U << SPI_CR1_CPOL_Pos)

#define    LL_SPI_SPI_PHASE_1EDGE                                 (0x0U << SPI_CR1_CPHA_Pos)
#define    LL_SPI_SPI_PHASE_2EDGE                                 (0x1U << SPI_CR1_CPHA_Pos)

#define    LL_SPI_DUMMY_CYCLE_DISABLE                             (0x0U << SPI_CR2_DUMMY_EN_Pos)
#define    LL_SPI_DUMMY_CYCLE_ENABLE                              (0x1U << SPI_CR2_DUMMY_EN_Pos)

#define    LL_SPI_RECV_ONLY_DISABLE                               (0x0U << SPI_CR2_RXO_Pos)
#define    LL_SPI_RECV_ONLY_ENABLE                                (0x1U << SPI_CR2_RXO_Pos)

#define    LL_SPI_DATAWIDTH_8BIT                                  (0x0U << SPI_CR2_DLEN_Pos)
#define    LL_SPI_DATAWIDTH_16BIT                                 (0x1U << SPI_CR2_DLEN_Pos)
#define    LL_SPI_DATAWIDTH_24BIT                                 (0x2U << SPI_CR2_DLEN_Pos)
#define    LL_SPI_DATAWIDTH_32BIT                                 (0x3U << SPI_CR2_DLEN_Pos)

#define    LL_SPI_MODE_FULL_DUPLEX                                (0x0U << SPI_CR2_HALFDUPLEX_Pos)
#define    LL_SPI_MODE_SIMPLEX                                    (0x1U << SPI_CR2_HALFDUPLEX_Pos)

#define    LL_SPI_SIMPLEX_DIRECTION_HALF_DUPLEX_TX                (0x0U << SPI_CR2_HD_RW_Pos)
#define    LL_SPI_SIMPLEX_DIRECTION_HALF_DUPLEX_RX                (0x1U << SPI_CR2_HD_RW_Pos)

#define    LL_SPI_SIMPLEX_CMD_LEN_CONFIG_AS_DLEN                  (0x0U << SPI_CR2_CMD8B_Pos)
#define    LL_SPI_SIMPLEX_CMD_LEN_FIX_8BIT                        (0x1U << SPI_CR2_CMD8B_Pos)

#define    LL_SPI_SSN_SEND_MODE_HIGH                              (0x0U << SPI_CR2_SSNM_Pos)
#define    LL_SPI_SSN_SEND_MODE_LOW                               (0x1U << SPI_CR2_SSNM_Pos)

