xdu-aero-association/FM33LC0XX_Example_0.04/SPI 从机中断示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_spi.h
/**
  * @brief    
  * @rmtoll   ISR    BUSY    LL_SPI_IsActiveFlag_SPIBusy
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_SPIBusy(SPI_Type* SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_BUSY_Msk) == (SPI_ISR_BUSY_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    MERR    LL_SPI_IsActiveFlag_MasterError
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_MasterError(SPI_Type* SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_MERR_Msk) == (SPI_ISR_MERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    MERR    LL_SPI_ClearFlag_MasterError
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void LL_SPI_ClearFlag_MasterError(SPI_Type* SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_ISR_MERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    SERR    LL_SPI_IsActiveFlag_SlaveError
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_SlaveError(SPI_Type* SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_SERR_Msk) == (SPI_ISR_SERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    SERR    LL_SPI_ClearFlag_SlaveError
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void LL_SPI_ClearFlag_SlaveError(SPI_Type* SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_ISR_SERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    TXBE    LL_SPI_IsActiveFlag_TxBufffEmpty
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_TxBufffEmpty(SPI_Type* SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_TXBE_Msk) == (SPI_ISR_TXBE_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RXBF    LL_SPI_IsActiveFlag_RxBufffFull
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_RxBufffFull(SPI_Type* SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_ISR_RXBF_Msk) == (SPI_ISR_RXBF_Msk));
}
/**
  * @brief    
  * @rmtoll   TXBUF        LL_SPI_WriteTxBuff
  * @param    SPIx SPI instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void LL_SPI_WriteTxBuff(SPI_Type* SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->TXBUF, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    
  * @rmtoll   RXBUF        LL_SPI_ReadRxBuff
  * @param    SPIx SPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_SPI_ReadRxBuff(SPI_Type* SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->RXBUF, 0xffffffffU) >> 0U);
}

/**
  * @}
  */

/** @defgroup SPI_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_SPI_DeInit(SPI_Type *SPIx);
ErrorStatus LL_SPI_Init(SPI_Type *SPIx,LL_SPI_InitTypeDef *SPI_InitStruct);
void LL_SPI_StructInit(LL_SPI_InitTypeDef *SPI_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_SPI_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-17**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
